add mermaid support, convert all ASCII diagrams to mermaid
